Revit 2027 API
BuiltInFailures.FabricSheetFailures.BentFabricSheetTooLongBendingProfile Property
 The bent edge is shorter than the bend profile for this fabric sheet type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BentFabricSheetTooLongBendingProfile { get; }
Public Shared ReadOnly Property BentFabricSheetTooLongBendingProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BentFabricSheetTooLongBendingProfile {
	FailureDefinitionId^ get ();
}
static member BentFabricSheetTooLongBendingProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricSheetFailures Class
Autodesk.Revit.DB Namespace